
libstdio.so:     file format elf64-x86-64

Contents of the .eh_frame section:


00000000 0000000000000014 00000000 CIE
  Version:               1
  Augmentation:          "zR"
  Code alignment factor: 1
  Data alignment factor: -8
  Return address column: 16
  Augmentation data:     1b
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_offset: r16 (rip) at cfa-8
  DW_CFA_nop
  DW_CFA_nop

00000018 000000000000001c 0000001c FDE cie=00000000 pc=0000000000000f93..0000000000000f9e
  DW_CFA_advance_loc: 1 to 0000000000000f94
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 0000000000000f97
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 6 to 0000000000000f9d
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000038 000000000000001c 0000003c FDE cie=00000000 pc=0000000000000f9e..0000000000000fad
  DW_CFA_advance_loc: 1 to 0000000000000f9f
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 0000000000000fa2
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 10 to 0000000000000fac
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000058 000000000000001c 0000005c FDE cie=00000000 pc=0000000000000fad..0000000000000fc2
  DW_CFA_advance_loc: 1 to 0000000000000fae
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 0000000000000fb1
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 16 to 0000000000000fc1

  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 6 to 000000000000162c
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000978 000000000000001c 0000097c FDE cie=00000000 pc=000000000000162d..0000000000001638
  DW_CFA_advance_loc: 1 to 000000000000162e
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 0000000000001631
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 6 to 0000000000001637
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000998 000000000000001c 0000099c FDE cie=00000000 pc=0000000000001638..0000000000001647
  DW_CFA_advance_loc: 1 to 0000000000001639
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 000000000000163c
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 10 to 0000000000001646
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

000009b8 000000000000001c 000009bc FDE cie=00000000 pc=0000000000001647..0000000000001652
  DW_CFA_advance_loc: 1 to 0000000000001648
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 000000000000164b
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 6 to 0000000000001651
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

000009d8 000000000000001c 000009dc FDE cie=00000000 pc=0000000000001652..000000000000165d
  DW_CFA_advance_loc: 1 to 0000000000001653
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 0000000000001656
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 6 to 000000000000165c
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

000009f8 000000000000001c 000009fc FDE cie=00000000 pc=000000000000165d..0000000000001668
  DW_CFA_advance_loc: 1 to 000000000000165e
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 0000000000001661
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 6 to 0000000000001667
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000a18 000000000000001c 00000a1c FDE cie=00000000 pc=0000000000001668..0000000000001673
  DW_CFA_advance_loc: 1 to 0000000000001669
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 000000000000166c
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 6 to 0000000000001672
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000a38 000000000000001c 00000a3c FDE cie=00000000 pc=0000000000001673..000000000000167e
  DW_CFA_advance_loc: 1 to 0000000000001674
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r6 (rbp) at cfa-16
  DW_CFA_advance_loc: 3 to 0000000000001677
  DW_CFA_def_cfa_register: r6 (rbp)
  DW_CFA_advance_loc: 6 to 000000000000167d
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

Contents of the .debug_aranges section:

  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x43c
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000000f93 00000000000006eb 
    0000000000000000 0000000000000000 

Contents of the .debug_pubnames section:

  Length:                              1084
  Version:                             2
  Offset into .debug_info section:     0x43c
  Size of area in .debug_info section: 5449

    Offset	Name
    169   	funlockfile
    1a0   	ftrylockfile
    1d1   	flockfile
    1fd   	ctermid
    22e   	pclose
    25f   	popen
    29e   	fileno_unlocked
    2cf   	fileno
    300   	perror
    32c   	ferror_unlocked
    35d   	feof_unlocked
    38e   	clearerr_unlocked
    3ba   	ferror
    3eb   	feof
    41c   	clearerr
    448   	fsetpos
    48d   	fgetpos
    4d7   	ftello
    508   	fseeko
    555   	rewind
    581   	ftell
    5b2   	fseek
    5ff   	fwrite_unlocked
    666   	fread_unlocked
    6c1   	fwrite
    71c   	fread
    777   	ungetc
    7b6   	puts
    7e7   	fputs
    826   	getline
    889   	getdelim
    8e4   	__getdelim
    93f   	fgets
    98c   	putw
    9cb   	getw
    9fc   	putchar_unlocked
    a2d   	putc_unlocked
    a6c   	fputc_unlocked
    aab   	putchar
    adc   	_IO_putc
    b1b   	fputc
    b5a   	fgetc_unlocked
    b8b   	getchar_unlocked
    ba8   	getc_unlocked
    bd9   	getchar
    bf6   	_IO_getc
    c27   	fgetc
    c58   	vsscanf
    cb2   	vscanf
    cf4   	vfscanf
    d44   	sscanf
    d89   	scanf
    dbf   	fscanf
    e04   	dprintf
    e46   	vdprintf
    e93   	vsnprintf
    eee   	snprintf
    f3f   	vsprintf
    f8c   	vprintf
    fcb   	vfprintf
    1018  	sprintf
    105a  	printf
    108d  	fprintf
    10cf  	setlinebuf
    10fb  	setbuffer
    1143  	setvbuf
    119e  	setbuf
    11d8  	open_memstream
    1217  	fmemopen
    1264  	fdopen
    12a3  	freopen
    12f0  	fopen
    132f  	fflush_unlocked
    1360  	fflush
    1391  	fclose
    13c2  	tempnam
    1401  	tmpnam_r
    1432  	tmpnam
    1463  	tmpfile
    1481  	renameat
    14dc  	rename
    151b  	remove

Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x67 (32-bit)
   Version:       5
   Abbrev Offset: 0x0
   Pointer Size:  8
   Signature:     0x8856ce10acb643ac
   Type Offset:   0x1e
 <0><18>: Abbrev Number: 1 (DW_TAG_type_unit)
    <19>   DW_AT_language    : 29	(C11)
    <1a>   DW_AT_stmt_list   : 0x0
 <1><1e>: Abbrev Number: 2 (DW_TAG_structure_type)
    <1f>   DW_AT_name        : (indirect string, offset: 0x66b): _IO_marker
    <23>   DW_AT_byte_size   : 24
    <24>   DW_AT_decl_file   : 2
    <25>   DW_AT_decl_line   : 161
    <26>   DW_AT_decl_column : 8
    <27>   DW_AT_sibling     : <0x53>
 <2><2b>: Abbrev Number: 3 (DW_TAG_member)
    <2c>   DW_AT_name        : (indirect string, offset: 0x5c3): _next
    <30>   DW_AT_decl_file   : 2
    <31>   DW_AT_decl_line   : 162
    <32>   DW_AT_decl_column : 22
    <33>   DW_AT_type        : <0x53>
    <37>   DW_AT_data_member_location: 0
 <2><38>: Abbrev Number: 3 (DW_TAG_member)
    <39>   DW_AT_name        : (indirect string, offset: 0x2ef): _sbuf
    <3d>   DW_AT_decl_file   : 2
    <3e>   DW_AT_decl_line   : 163
    <3f>   DW_AT_decl_column : 20
    <40>   DW_AT_type        : <0x59>
    <44>   DW_AT_data_member_location: 8
 <2><45>: Abbrev Number: 3 (DW_TAG_member)
    <46>   DW_AT_name        : (indirect string, offset: 0x258): _pos
    <4a>   DW_AT_decl_file   : 2
    <4b>   DW_AT_decl_line   : 167
    <4c>   DW_AT_decl_column : 7
    <4d>   DW_AT_type        : <0x63>
    <51>   DW_AT_data_member_location: 16
 <2><52>: Abbrev Number: 0
 <1><53>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <54>   DW_AT_byte_size   : 8
    <55>   DW_AT_type        : <0x1e>
 <1><59>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <5a>   DW_AT_byte_size   : 8
    <5b>   DW_AT_type        : signature: 0xa8df1933f740ec32
 <1><63>: Abbrev Number: 6 (DW_TAG_base_type)
    <64>   DW_AT_byte_size   : 4
    <65>   DW_AT_encoding    : 5	(signed)
    <66>   DW_AT_name        : int
 <1><6a>: Abbrev Number: 0
  Compilation Unit @ offset 0x6b:
   Length:        0x61 (32-bit)
   Version:       5
   Abbrev Offset: 0x0
   Pointer Size:  8
   Signature:     0x9ecc66244d5f3814
   Type Offset:   0x1e
 <0><83>: Abbrev Number: 1 (DW_TAG_type_unit)
    <84>   DW_AT_language    : 29	(C11)
    <85>   DW_AT_stmt_list   : 0x0
 <1><89>: Abbrev Number: 7 (DW_TAG_structure_type)
    <8a>   DW_AT_name        : (indirect string, offset: 0x72c): __va_list_tag
    <8e>   DW_AT_byte_size   : 24
    <8f>   DW_AT_decl_file   : 3
    <90>   DW_AT_decl_line   : 0
    <91>   DW_AT_sibling     : <0xc6>
 <2><95>: Abbrev Number: 8 (DW_TAG_member)
    <96>   DW_AT_name        : (indirect string, offset: 0x10a): gp_offset
    <9a>   DW_AT_decl_file   : 3
    <9b>   DW_AT_decl_line   : 0
    <9c>   DW_AT_type        : <0xc6>
    <a0>   DW_AT_data_member_location: 0
 <2><a1>: Abbrev Number: 8 (DW_TAG_member)
    <a2>   DW_AT_name        : (indirect string, offset: 0x6a2): fp_offset
    <a6>   DW_AT_decl_file   : 3
    <a7>   DW_AT_decl_line   : 0
    <a8>   DW_AT_type        : <0xc6>
    <ac>   DW_AT_data_member_location: 4
 <2><ad>: Abbrev Number: 8 (DW_TAG_member)
    <ae>   DW_AT_name        : (indirect string, offset: 0x485): overflow_arg_area
    <b2>   DW_AT_decl_file   : 3
    <b3>   DW_AT_decl_line   : 0
    <b4>   DW_AT_type        : <0xcd>
    <b8>   DW_AT_data_member_location: 8
 <2><b9>: Abbrev Number: 8 (DW_TAG_member)
    <ba>   DW_AT_name        : (indirect string, offset: 0x555): reg_save_area
    <be>   DW_AT_decl_file   : 3
    <bf>   DW_AT_decl_line   : 0
    <c0>   DW_AT_type        : <0xcd>
    <c4>   DW_AT_data_member_location: 16
 <2><c5>: Abbrev Number: 0
 <1><c6>: Abbrev Number: 9 (DW_TAG_base_type)
    <c7>   DW_AT_byte_size   : 4
    <c8>   DW_AT_encoding    : 7	(unsigned)
    <c9>   DW_AT_name        : (indirect string, offset: 0x2ab): unsigned int
 <1><cd>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 8
 <1><cf>: Abbrev Number: 0
  Compilation Unit @ offset 0xd0:
   Length:        0x62 (32-bit)
   Version:       5
   Abbrev Offset: 0x0
   Pointer Size:  8
   Signature:     0x7b8eb2ea57c51d3f
   Type Offset:   0x1e
 <0><e8>: Abbrev Number: 1 (DW_TAG_type_unit)
    <e9>   DW_AT_language    : 29	(C11)
    <ea>   DW_AT_stmt_list   : 0x0
 <1><ee>: Abbrev Number: 11 (DW_TAG_structure_type)
    <ef>   DW_AT_byte_size   : 16
    <f0>   DW_AT_decl_file   : 4
    <f1>   DW_AT_decl_line   : 21
    <f2>   DW_AT_decl_column : 9
    <f3>   DW_AT_sibling     : <0x112>
 <2><f7>: Abbrev Number: 3 (DW_TAG_member)
    <f8>   DW_AT_name        : (indirect string, offset: 0x257): __pos
    <fc>   DW_AT_decl_file   : 4
    <fd>   DW_AT_decl_line   : 23
    <fe>   DW_AT_decl_column : 11
    <ff>   DW_AT_type        : <0x112>
    <103>   DW_AT_data_member_location: 0
 <2><104>: Abbrev Number: 3 (DW_TAG_member)
    <105>   DW_AT_name        : (indirect string, offset: 0x4e3): __state
    <109>   DW_AT_decl_file   : 4
    <10a>   DW_AT_decl_line   : 24
    <10b>   DW_AT_decl_column : 15
    <10c>   DW_AT_type        : <0x11e>
    <110>   DW_AT_data_member_location: 8
 <2><111>: Abbrev Number: 0
 <1><112>: Abbrev Number: 12 (DW_TAG_typedef)
    <113>   DW_AT_name        : (indirect string, offset: 0x0): __off_t
    <117>   DW_AT_decl_file   : 5
    <118>   DW_AT_decl_line   : 140
    <119>   DW_AT_decl_column : 25
    <11a>   DW_AT_type        : <0x12e>
 <1><11e>: Abbrev Number: 13 (DW_TAG_typedef)
    <11f>   DW_AT_name        : (indirect string, offset: 0x14f): __mbstate_t
    <123>   DW_AT_decl_file   : 6
    <124>   DW_AT_decl_line   : 94
    <125>   DW_AT_decl_column : 3
    <126>   DW_AT_type        : signature: 0x50086e30254b8230
 <1><12e>: Abbrev Number: 9 (DW_TAG_base_type)
    <12f>   DW_AT_byte_size   : 8
    <130>   DW_AT_encoding    : 5	(signed)
    <131>   DW_AT_name        : (indirect string, offset: 0x1a6): long int
 <1><135>: Abbrev Number: 0
  Compilation Unit @ offset 0x136:
   Length:        0x4a (32-bit)
   Version:       5
   Abbrev Offset: 0x0
   Pointer Size:  8
   Signature:     0x50086e30254b8230
   Type Offset:   0x1e
 <0><14e>: Abbrev Number: 1 (DW_TAG_type_unit)
    <14f>   DW_AT_language    : 29	(C11)
    <150>   DW_AT_stmt_list   : 0x0
 <1><154>: Abbrev Number: 11 (DW_TAG_structure_type)
    <155>   DW_AT_byte_size   : 8
    <156>   DW_AT_decl_file   : 6
    <157>   DW_AT_decl_line   : 82
    <158>   DW_AT_decl_column : 9
    <159>   DW_AT_sibling     : <0x17c>
 <2><15d>: Abbrev Number: 3 (DW_TAG_member)
    <15e>   DW_AT_name        : (indirect string, offset: 0x569): __count
    <162>   DW_AT_decl_file   : 6
    <163>   DW_AT_decl_line   : 84
    <164>   DW_AT_decl_column : 7
    <165>   DW_AT_type        : <0x17c>
    <169>   DW_AT_data_member_location: 0
 <2><16a>: Abbrev Number: 14 (DW_TAG_member)
    <16b>   DW_AT_name        : (indirect string, offset: 0x5d3): __value
    <16f>   DW_AT_decl_file   : 6
    <170>   DW_AT_decl_line   : 93
    <171>   DW_AT_decl_column : 5
    <172>   DW_AT_type        : signature: 0x1ba70d76441706cf
    <17a>   DW_AT_data_member_location: 4
 <2><17b>: Abbrev Number: 0
 <1><17c>: Abbrev Number: 6 (DW_TAG_base_type)
    <17d>   DW_AT_byte_size   : 4
    <17e>   DW_AT_encoding    : 5	(signed)
    <17f>   DW_AT_name        : int
 <1><183>: Abbrev Number: 0
  Compilation Unit @ offset 0x184:
   Length:        0x62 (32-bit)
   Version:       5
   Abbrev Offset: 0x0
   Pointer Size:  8
   Signature:     0x1ba70d76441706cf
   Type Offset:   0x1e
 <0><19c>: Abbrev Number: 1 (DW_TAG_type_unit)
    <19d>   DW_AT_language    : 29	(C11)
    <19e>   DW_AT_stmt_list   : 0x0
 <1><1a2>: Abbrev Number: 15 (DW_TAG_union_type)
    <1a3>   DW_AT_byte_size   : 4
    <1a4>   DW_AT_decl_file   : 6
    <1a5>   DW_AT_decl_line   : 85
    <1a6>   DW_AT_decl_column : 3
    <1a7>   DW_AT_sibling     : <0x1c4>
 <2><1ab>: Abbrev Number: 16 (DW_TAG_member)
    <1ac>   DW_AT_name        : (indirect string, offset: 0x331): __wch
    <1b0>   DW_AT_decl_file   : 6
    <1b1>   DW_AT_decl_line   : 88
    <1b2>   DW_AT_decl_column : 19
    <1b3>   DW_AT_type        : <0x1c4>
 <2><1b7>: Abbrev Number: 16 (DW_TAG_member)
    <1b8>   DW_AT_name        : (indirect string, offset: 0x288): __wchb
    <1bc>   DW_AT_decl_file   : 6
    <1bd>   DW_AT_decl_line   : 92
    <1be>   DW_AT_decl_column : 10
    <1bf>   DW_AT_type        : <0x1cb>
 <2><1c3>: Abbrev Number: 0
 <1><1c4>: Abbrev Number: 9 (DW_TAG_base_type)
    <1c5>   DW_AT_byte_size   : 4
    <1c6>   DW_AT_encoding    : 7	(unsigned)
    <1c7>   DW_AT_name        : (indirect string, offset: 0x2ab): unsigned int
 <1><1cb>: Abbrev Number: 17 (DW_TAG_array_type)
    <1cc>   DW_AT_type        : <0x1db>
    <1d0>   DW_AT_sibling     : <0x1db>
 <2><1d4>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <1d5>   DW_AT_type        : <0x1e2>
    <1d9>   DW_AT_upper_bound : 3
 <2><1da>: Abbrev Number: 0
 <1><1db>: Abbrev Number: 9 (DW_TAG_base_type)
    <1dc>   DW_AT_byte_size   : 1
    <1dd>   DW_AT_encoding    : 6	(signed char)
    <1de>   DW_AT_name        : (indirect string, offset: 0x4fb): char
 <1><1e2>: Abbrev Number: 9 (DW_TAG_base_type)
    <1e3>   DW_AT_byte_size   : 8
    <1e4>   DW_AT_encoding    : 7	(unsigned)
    <1e5>   DW_AT_name        : (indirect string, offset: 0x2a6): long unsigned int
 <1><1e9>: Abbrev Number: 0
  Compilation Unit @ offset 0x1ea:
   Length:        0x24e (32-bit)
   Version:       5
   Abbrev Offset: 0x0
   Pointer Size:  8
   Signature:     0xa8df1933f740ec32
   Type Offset:   0x1e
 <0><202>: Abbrev Number: 1 (DW_TAG_type_unit)
    <203>   DW_AT_language    : 29	(C11)
    <204>   DW_AT_stmt_list   : 0x0
 <1><208>: Abbrev Number: 2 (DW_TAG_structure_type)
    <209>   DW_AT_name        : (indirect string, offset: 0x45f): _IO_FILE
    <20d>   DW_AT_byte_size   : 216
    <20e>   DW_AT_decl_file   : 2
    <20f>   DW_AT_decl_line   : 246
    <210>   DW_AT_decl_column : 8
    <211>   DW_AT_sibling     : <0x3a7>
 <2><215>: Abbrev Number: 3 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x1be): _flags
    <21a>   DW_AT_decl_file   : 2
    <21b>   DW_AT_decl_line   : 247
    <21c>   DW_AT_decl_column : 7
    <21d>   DW_AT_type        : <0x3a7>
    <221>   DW_AT_data_member_location: 0
 <2><222>: Abbrev Number: 3 (DW_TAG_member)
    <223>   DW_AT_name        : (indirect string, offset: 0x19): _IO_read_ptr
    <227>   DW_AT_decl_file   : 2
    <228>   DW_AT_decl_line   : 252
    <229>   DW_AT_decl_column : 9
    <22a>   DW_AT_type        : <0x3ae>
    <22e>   DW_AT_data_member_location: 8
 <2><22f>: Abbrev Number: 3 (DW_TAG_member)
    <230>   DW_AT_name        : (indirect string, offset: 0x191): _IO_read_end
    <234>   DW_AT_decl_file   : 2
    <235>   DW_AT_decl_line   : 253
    <236>   DW_AT_decl_column : 9
    <237>   DW_AT_type        : <0x3ae>
    <23b>   DW_AT_data_member_location: 16
 <2><23c>: Abbrev Number: 3 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0x5db): _IO_read_base
    <241>   DW_AT_decl_file   : 2
    <242>   DW_AT_decl_line   : 254
    <243>   DW_AT_decl_column : 9
    <244>   DW_AT_type        : <0x3ae>
    <248>   DW_AT_data_member_location: 24
 <2><249>: Abbrev Number: 3 (DW_TAG_member)
    <24a>   DW_AT_name        : (indirect string, offset: 0x6fe): _IO_write_base
    <24e>   DW_AT_decl_file   : 2
    <24f>   DW_AT_decl_line   : 255
    <250>   DW_AT_decl_column : 9
    <251>   DW_AT_type        : <0x3ae>
    <255>   DW_AT_data_member_location: 32
 <2><256>: Abbrev Number: 19 (DW_TAG_member)
    <257>   DW_AT_name        : (indirect string, offset: 0x2cd): _IO_write_ptr
    <25b>   DW_AT_decl_file   : 2
    <25c>   DW_AT_decl_line   : 256
    <25e>   DW_AT_decl_column : 9
    <25f>   DW_AT_type        : <0x3ae>
    <263>   DW_AT_data_member_location: 40
 <2><264>: Abbrev Number: 19 (DW_TAG_member)
    <265>   DW_AT_name        : (indirect string, offset: 0x3f6): _IO_write_end
    <269>   DW_AT_decl_file   : 2
    <26a>   DW_AT_decl_line   : 257
    <26c>   DW_AT_decl_column : 9
    <26d>   DW_AT_type        : <0x3ae>
    <271>   DW_AT_data_member_location: 48
 <2><272>: Abbrev Number: 19 (DW_TAG_member)
    <273>   DW_AT_name        : (indirect string, offset: 0x12b): _IO_buf_base
    <277>   DW_AT_decl_file   : 2
    <278>   DW_AT_decl_line   : 258
    <27a>   DW_AT_decl_column : 9
    <27b>   DW_AT_type        : <0x3ae>
    <27f>   DW_AT_data_member_location: 56
 <2><280>: Abbrev Number: 19 (DW_TAG_member)
    <281>   DW_AT_name        : (indirect string, offset: 0x1f0): _IO_buf_end
    <285>   DW_AT_decl_file   : 2
    <286>   DW_AT_decl_line   : 259
    <288>   DW_AT_decl_column : 9
    <289>   DW_AT_type        : <0x3ae>
    <28d>   DW_AT_data_member_location: 64
 <2><28e>: Abbrev Number: 19 (DW_TAG_member)
    <28f>   DW_AT_name        : (indirect string, offset: 0x3d2): _IO_save_base
    <293>   DW_AT_decl_file   : 2
    <294>   DW_AT_decl_line   : 261
    <296>   DW_AT_decl_column : 9
    <297>   DW_AT_type        : <0x3ae>
    <29b>   DW_AT_data_member_location: 72
 <2><29c>: Abbrev Number: 19 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0x13f): _IO_backup_base
    <2a1>   DW_AT_decl_file   : 2
    <2a2>   DW_AT_decl_line   : 262
    <2a4>   DW_AT_decl_column : 9
    <2a5>   DW_AT_type        : <0x3ae>
    <2a9>   DW_AT_data_member_location: 80
 <2><2aa>: Abbrev Number: 19 (DW_TAG_member)
    <2ab>   DW_AT_name        : (indirect string, offset: 0x5f2): _IO_save_end
    <2af>   DW_AT_decl_file   : 2
    <2b0>   DW_AT_decl_line   : 263
    <2b2>   DW_AT_decl_column : 9
    <2b3>   DW_AT_type        : <0x3ae>
    <2b7>   DW_AT_data_member_location: 88
 <2><2b8>: Abbrev Number: 19 (DW_TAG_member)
    <2b9>   DW_AT_name        : (indirect string, offset: 0x4da): _markers
    <2bd>   DW_AT_decl_file   : 2
    <2be>   DW_AT_decl_line   : 265
    <2c0>   DW_AT_decl_column : 22
    <2c1>   DW_AT_type        : <0x3b4>
    <2c5>   DW_AT_data_member_location: 96
 <2><2c6>: Abbrev Number: 19 (DW_TAG_member)
    <2c7>   DW_AT_name        : (indirect string, offset: 0x519): _chain
    <2cb>   DW_AT_decl_file   : 2
    <2cc>   DW_AT_decl_line   : 267
    <2ce>   DW_AT_decl_column : 20
    <2cf>   DW_AT_type        : <0x3be>
    <2d3>   DW_AT_data_member_location: 104
 <2><2d4>: Abbrev Number: 19 (DW_TAG_member)
    <2d5>   DW_AT_name        : (indirect string, offset: 0x19e): _fileno
    <2d9>   DW_AT_decl_file   : 2
    <2da>   DW_AT_decl_line   : 269
    <2dc>   DW_AT_decl_column : 7
    <2dd>   DW_AT_type        : <0x3a7>
    <2e1>   DW_AT_data_member_location: 112
 <2><2e2>: Abbrev Number: 19 (DW_TAG_member)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x520): _flags2
    <2e7>   DW_AT_decl_file   : 2
    <2e8>   DW_AT_decl_line   : 273
    <2ea>   DW_AT_decl_column : 7
    <2eb>   DW_AT_type        : <0x3a7>
    <2ef>   DW_AT_data_member_location: 116
 <2><2f0>: Abbrev Number: 19 (DW_TAG_member)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x220): _old_offset
    <2f5>   DW_AT_decl_file   : 2
    <2f6>   DW_AT_decl_line   : 275
    <2f8>   DW_AT_decl_column : 13
    <2f9>   DW_AT_type        : <0x3c4>
    <2fd>   DW_AT_data_member_location: 120
 <2><2fe>: Abbrev Number: 19 (DW_TAG_member)
    <2ff>   DW_AT_name        : (indirect string, offset: 0x315): _cur_column
    <303>   DW_AT_decl_file   : 2
    <304>   DW_AT_decl_line   : 279
    <306>   DW_AT_decl_column : 18
    <307>   DW_AT_type        : <0x3d0>
    <30b>   DW_AT_data_member_location: 128
 <2><30c>: Abbrev Number: 19 (DW_TAG_member)
    <30d>   DW_AT_name        : (indirect string, offset: 0x536): _vtable_offset
    <311>   DW_AT_decl_file   : 2
    <312>   DW_AT_decl_line   : 280
    <314>   DW_AT_decl_column : 15
    <315>   DW_AT_type        : <0x3d7>
    <319>   DW_AT_data_member_location: 130
 <2><31a>: Abbrev Number: 19 (DW_TAG_member)
    <31b>   DW_AT_name        : (indirect string, offset: 0x100): _shortbuf
    <31f>   DW_AT_decl_file   : 2
    <320>   DW_AT_decl_line   : 281
    <322>   DW_AT_decl_column : 8
    <323>   DW_AT_type        : <0x3de>
    <327>   DW_AT_data_member_location: 131
 <2><328>: Abbrev Number: 19 (DW_TAG_member)
    <329>   DW_AT_name        : (indirect string, offset: 0x345): _lock
    <32d>   DW_AT_decl_file   : 2
    <32e>   DW_AT_decl_line   : 285
    <330>   DW_AT_decl_column : 15
    <331>   DW_AT_type        : <0x3ee>
    <335>   DW_AT_data_member_location: 136
 <2><336>: Abbrev Number: 19 (DW_TAG_member)
    <337>   DW_AT_name        : (indirect string, offset: 0x224): _offset
    <33b>   DW_AT_decl_file   : 2
    <33c>   DW_AT_decl_line   : 294
    <33e>   DW_AT_decl_column : 15
    <33f>   DW_AT_type        : <0x3f4>
    <343>   DW_AT_data_member_location: 144
 <2><344>: Abbrev Number: 19 (DW_TAG_member)
    <345>   DW_AT_name        : (indirect string, offset: 0x628): __pad1
    <349>   DW_AT_decl_file   : 2
    <34a>   DW_AT_decl_line   : 303
    <34c>   DW_AT_decl_column : 9
    <34d>   DW_AT_type        : <0x400>
    <351>   DW_AT_data_member_location: 152
 <2><352>: Abbrev Number: 19 (DW_TAG_member)
    <353>   DW_AT_name        : (indirect string, offset: 0x62f): __pad2
    <357>   DW_AT_decl_file   : 2
    <358>   DW_AT_decl_line   : 304
    <35a>   DW_AT_decl_column : 9
    <35b>   DW_AT_type        : <0x400>
    <35f>   DW_AT_data_member_location: 160
 <2><360>: Abbrev Number: 19 (DW_TAG_member)
    <361>   DW_AT_name        : (indirect string, offset: 0x636): __pad3
    <365>   DW_AT_decl_file   : 2
    <366>   DW_AT_decl_line   : 305
    <368>   DW_AT_decl_column : 9
    <369>   DW_AT_type        : <0x400>
    <36d>   DW_AT_data_member_location: 168
 <2><36e>: Abbrev Number: 19 (DW_TAG_member)
    <36f>   DW_AT_name        : (indirect string, offset: 0x63d): __pad4
    <373>   DW_AT_decl_file   : 2
    <374>   DW_AT_decl_line   : 306
    <376>   DW_AT_decl_column : 9
    <377>   DW_AT_type        : <0x400>
    <37b>   DW_AT_data_member_location: 176
 <2><37c>: Abbrev Number: 19 (DW_TAG_member)
    <37d>   DW_AT_name        : (indirect string, offset: 0x644): __pad5
    <381>   DW_AT_decl_file   : 2
    <382>   DW_AT_decl_line   : 307
    <384>   DW_AT_decl_column : 10
    <385>   DW_AT_type        : <0x402>
    <389>   DW_AT_data_member_location: 184
 <2><38a>: Abbrev Number: 19 (DW_TAG_member)
    <38b>   DW_AT_name        : (indirect string, offset: 0x356): _mode
    <38f>   DW_AT_decl_file   : 2
    <390>   DW_AT_decl_line   : 309
    <392>   DW_AT_decl_column : 7
    <393>   DW_AT_type        : <0x3a7>
    <397>   DW_AT_data_member_location: 192
 <2><398>: Abbrev Number: 19 (DW_TAG_member)
    <399>   DW_AT_name        : (indirect string, offset: 0x64b): _unused2
    <39d>   DW_AT_decl_file   : 2
    <39e>   DW_AT_decl_line   : 311
    <3a0>   DW_AT_decl_column : 8
    <3a1>   DW_AT_type        : <0x40e>
    <3a5>   DW_AT_data_member_location: 196
 <2><3a6>: Abbrev Number: 0
 <1><3a7>: Abbrev Number: 6 (DW_TAG_base_type)
    <3a8>   DW_AT_byte_size   : 4
    <3a9>   DW_AT_encoding    : 5	(signed)
    <3aa>   DW_AT_name        : int
 <1><3ae>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3af>   DW_AT_byte_size   : 8
    <3b0>   DW_AT_type        : <0x41e>
 <1><3b4>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <3b5>   DW_AT_byte_size   : 8
    <3b6>   DW_AT_type        : signature: 0x8856ce10acb643ac
 <1><3be>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3bf>   DW_AT_byte_size   : 8
    <3c0>   DW_AT_type        : <0x208>
 <1><3c4>: Abbrev Number: 12 (DW_TAG_typedef)
    <3c5>   DW_AT_name        : (indirect string, offset: 0x0): __off_t
    <3c9>   DW_AT_decl_file   : 5
    <3ca>   DW_AT_decl_line   : 140
    <3cb>   DW_AT_decl_column : 25
    <3cc>   DW_AT_type        : <0x425>
 <1><3d0>: Abbrev Number: 9 (DW_TAG_base_type)
    <3d1>   DW_AT_byte_size   : 2
    <3d2>   DW_AT_encoding    : 7	(unsigned)
    <3d3>   DW_AT_name        : (indirect string, offset: 0x2f5): short unsigned int
 <1><3d7>: Abbrev Number: 9 (DW_TAG_base_type)
    <3d8>   DW_AT_byte_size   : 1
    <3d9>   DW_AT_encoding    : 6	(signed char)
    <3da>   DW_AT_name        : (indirect string, offset: 0x4f4): signed char
 <1><3de>: Abbrev Number: 17 (DW_TAG_array_type)
    <3df>   DW_AT_type        : <0x41e>
    <3e3>   DW_AT_sibling     : <0x3ee>
 <2><3e7>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <3e8>   DW_AT_type        : <0x42c>
    <3ec>   DW_AT_upper_bound : 0
 <2><3ed>: Abbrev Number: 0
 <1><3ee>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <3ef>   DW_AT_byte_size   : 8
    <3f0>   DW_AT_type        : <0x433>
 <1><3f4>: Abbrev Number: 12 (DW_TAG_typedef)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x5c9): __off64_t
    <3f9>   DW_AT_decl_file   : 5
    <3fa>   DW_AT_decl_line   : 141
    <3fb>   DW_AT_decl_column : 27
    <3fc>   DW_AT_type        : <0x425>
 <1><400>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <401>   DW_AT_byte_size   : 8
 <1><402>: Abbrev Number: 12 (DW_TAG_typedef)
    <403>   DW_AT_name        : (indirect string, offset: 0x1e9): size_t
    <407>   DW_AT_decl_file   : 7
    <408>   DW_AT_decl_line   : 216
    <409>   DW_AT_decl_column : 23
    <40a>   DW_AT_type        : <0x42c>
 <1><40e>: Abbrev Number: 17 (DW_TAG_array_type)
    <40f>   DW_AT_type        : <0x41e>
    <413>   DW_AT_sibling     : <0x41e>
 <2><417>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <418>   DW_AT_type        : <0x42c>
    <41c>   DW_AT_upper_bound : 19
 <2><41d>: Abbrev Number: 0
 <1><41e>: Abbrev Number: 9 (DW_TAG_base_type)
    <41f>   DW_AT_byte_size   : 1
    <420>   DW_AT_encoding    : 6	(signed char)
    <421>   DW_AT_name        : (indirect string, offset: 0x4fb): char
 <1><425>: Abbrev Number: 9 (DW_TAG_base_type)
    <426>   DW_AT_byte_size   : 8
    <427>   DW_AT_encoding    : 5	(signed)
    <428>   DW_AT_name        : (indirect string, offset: 0x1a6): long int
 <1><42c>: Abbrev Number: 9 (DW_TAG_base_type)
    <42d>   DW_AT_byte_size   : 8
    <42e>   DW_AT_encoding    : 7	(unsigned)
    <42f>   DW_AT_name        : (indirect string, offset: 0x2a6): long unsigned int
 <1><433>: Abbrev Number: 20 (DW_TAG_typedef)
    <434>   DW_AT_name        : (indirect string, offset: 0x454): _IO_lock_t
    <438>   DW_AT_decl_file   : 2
    <439>   DW_AT_decl_line   : 155
    <43a>   DW_AT_decl_column : 14
 <1><43b>: Abbrev Number: 0
  Compilation Unit @ offset 0x43c:
   Length:        0x1545 (32-bit)
   Version:       5
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><448>: Abbrev Number: 33 (DW_TAG_compile_unit)
    <449>   DW_AT_producer    : (indirect string, offset: 0x2d): GNU C17 8.3.1 20190311 (Red Hat 8.3.1-3) -mtune=generic -march=x86-64 -g -gpubnames -gstrict-dwarf -g3 -gdwarf-5 -fPIC -feliminate-unused-debug-symbols -feliminate-unused-debug-types -fdebug-types-section
    <44d>   DW_AT_language    : 29	(C11)
